In [3]:
%matplotlib inline
import pandas as pd

In [2]:
from IPython.core.display import HTML
css = open('style-table.css').read() + open('style-notebook.css').read()
HTML('<style>{}</style>'.format(css))

In [145]:
titles = pd.read_csv('C:/Users/Admin/titles.csv')
release = pd.read_csv('C:/Users/Admin/release_dates.csv')
cast = pd.read_csv('C:/Users/Admin/cast.csv')

titles.head()

                  title  year
0    Tasveer Mere Sanam  1996
1              Only You  1994
2  El pueblo del terror  1970
3               Machine  2007
4                  MARy  2008

3786176

### How many movies are listed in the titles dataframe?

In [11]:
titles.shape[0]

244914

### What are the earliest two films listed in the titles dataframe?

In [20]:
t1=titles.sort_values("year")
t1.head(2)

                     title  year
193222          Miss Jerry  1894
51388   The Startled Lover  1898

### How many movies have the title "Hamlet"?

In [46]:
t2= titles[titles["title"].str.contains("Hamlet")]
t2.shape[0]

57

### How many movies are titled "North by Northwest"?

In [77]:
t3= titles[titles["title"].str.contains("North by Northwest")]
t3.shape[0]

1

In [125]:
titles

                                      title  year
0                        Tasveer Mere Sanam  1996
1                                  Only You  1994
2                      El pueblo del terror  1970
3                                   Machine  2007
4                                      MARy  2008
...                                     ...   ...
244909  Black Butterfly in a Colorful World  2018
244910        Hua fei hua wu chun man cheng  1980
244911                 Nippon dabi katsukyu  1970
244912        Under Siege 2: Dark Territory  1995
244913            She Must Be Seeing Things  1987

[244914 rows x 2 columns]

### When was the first movie titled "Hamlet" made?

In [78]:
t4=t2.sort_values("year").head(1)
t4

        title  year
52521  Hamlet  1910

### List all of the "Treasure Island" movies from earliest to most recent.

In [82]:
t5= titles[titles["title"].str.contains("Treasure Island")].sort_values("year")
t5

                                                    title  year
55686                                     Treasure Island  1918
196514                                    Treasure Island  1920
141822                                    Treasure Island  1934
64173                       The Secret of Treasure Island  1938
79701                     Charlie Chan at Treasure Island  1939
77354                                     Treasure Island  1950
34341                           Return to Treasure Island  1954
34288                           Five on a Treasure Island  1957
65051                                     Treasure Island  1972
37238                                     Treasure Island  1973
173051                                    Treasure Island  1985
26111                              Muppet Treasure Island  1996
27076                                     Treasure Island  1999
216970                               Treasure Island (II)  1999
209707  Treasure Island Kids: The Battle of Treasure I...  2006
2830                           Pirates of Treasure Island  2006
112591  Treasure Island Kids: The Mystery of Treasure ...  2006
244541  Treasure Island Kids: The Monster of Treasure ...  2006
155317             National Theatre Live: Treasure Island  2015

### How many movies were made in the year 1950?

In [91]:
len(titles[titles.year == 1950])

1113

### How many movies were made in the year 1960?

In [96]:
len(titles[titles.year == 1960])

1549

### How many movies were made from 1950 through 1959?

In [132]:
titles.head()

                  title  year
0    Tasveer Mere Sanam  1996
1              Only You  1994
2  El pueblo del terror  1970
3               Machine  2007
4                  MARy  2008

In [126]:
s=0
sum=0
for i in range(1950,1960):
    s = (titles[titles.year == i]).shape[0]
    sum=sum +s
print("No of movies made from 1950 to 1959 is ",sum)

No of movies made from 1950 to 1959 is  12934

### In what years has a movie titled "Batman" been released?

In [141]:
t8=(titles[titles.title == "Batman"])
t8.head()

         title  year
39349   Batman  1943
240896  Batman  1989

In [158]:
cast.head()

                  title  year      name   type                character     n
0        Closet Monster  2015  Buffy #1  actor                  Buffy 4  31.0
1       Suuri illusioni  1985    Homo $  actor                   Guests  22.0
2   Battle of the Sexes  2017   $hutter  actor          Bobby Riggs Fan  10.0
3  Secret in Their Eyes  2015   $hutter  actor          2002 Dodger Fan   NaN
4            Steve Jobs  2015   $hutter  actor  1988 Opera House Patron   NaN

### How many roles were there in the movie "Inception"?

In [208]:
t9=(cast[cast.title == "Inception"])
#list(cast['type'].value_counts().index)
print("No of roles in inception movie are ",t9.shape[0])

No of roles in inception movie are  78

### How many roles in the movie "Inception" are NOT ranked by an "n" value?

In [210]:
l=len(t9)
t10= t9.groupby('n').mean()
l1=len(t10)
n=l-l1
print("No of roles not ranked by n value are ",n)

No of roles not ranked by n value are  27

### But how many roles in the movie "Inception" did receive an "n" value?

In [211]:
t10= t9.groupby('n').mean()
print("No of roles ranked by n value are ",len(t10))

No of roles ranked by n value are  51

### Display the cast of "North by Northwest" in their correct "n"-value order, ignoring roles that did not earn a numeric "n" value.

In [258]:
nbn = cast.loc[lambda cast: cast['title'] == "North by Northwest", :]
nbn = nbn.sort_values("n")
print(nbn.isna().sum())
nbn = nbn.iloc[:(nbn.shape[0]-nbn.isna().sum().sum()),:]
nbn

title          0
year           0
name           0
type           0
character      0
n            100
dtype: int64

,title,year,name,type,character,n
871426,North by Northwest,1959,Cary Grant,actor,Roger O. Thornhill,1.0
3518333,North by Northwest,1959,Eva Marie Saint,actress,Eve Kendall,2.0
1457165,North by Northwest,1959,James Mason,actor,Phillip Vandamm,3.0
3157232,North by Northwest,1959,Jessie Royce Landis,actress,Clara Thornhill,4.0
356707,North by Northwest,1959,Leo G. Carroll,actor,The Professor,5.0
3048272,North by Northwest,1959,Josephine Hutchinson,actress,Mrs. Townsend,6.0
1695173,North by Northwest,1959,Philip Ober,actor,Lester Townsend,7.0
1275337,North by Northwest,1959,Martin Landau,actor,Leonard,8.0
2447081,North by Northwest,1959,Adam Williams,actor,Valerian,9.0
1811387,North by Northwest,1959,Edward Platt,actor,Victor Larrabee,10.0
665768,North by Northwest,1959,Robert Ellenstein,actor,Licht,11.0
2295714,North by Northwest,1959,Les Tremayne,actor,Auctioneer,12.0
464736,North by Northwest,1959,Philip Coolidge,actor,Dr. Cross,13.0
1508344,North by Northwest,1959,Patrick McVey,actor,Sergeant Flamm,14.0
206471,North by Northwest,1959,Edward Binns,actor,Captain Junket,15.0
1384780,North by Northwest,1959,Ken Lynch,actor,Charley - Chicago Policeman,16.0

### Display the entire cast, in "n"-order, of the 1972 film "Sleuth".

In [220]:
t11=(cast[cast.title == "Sleuth"])
t12=t11.sort_values("n")
t12

,title,year,name,type,character,n
326774,Sleuth,2007,Michael Caine,actor,Andrew,1.0
1705394,Sleuth,1972,Laurence Olivier,actor,Andrew Wyke,1.0
326773,Sleuth,1972,Michael Caine,actor,Milo Tindle,2.0
1293634,Sleuth,2007,Jude Law,actor,Milo,2.0
373876,Sleuth,1972,Alec Cawthorne,actor,Inspector Doppler,3.0
1805907,Sleuth,2007,Harold Pinter,actor,Man on T.V.,3.0
1465483,Sleuth,1972,John (II) Matthews,actor,Detective Sergeant Tarrant,4.0
2724553,Sleuth,1972,Eve (III) Channing,actress,Marguerite Wyke,5.0
1448690,Sleuth,1972,Teddy Martin,actor,Police Constable Higgs,6.0
260242,Sleuth,2007,Kenneth Branagh,actor,Other Man on T.V.,NaN
373877,Sleuth,2007,Alec (II) Cawthorne,actor,Inspector Doppler,NaN
2724552,Sleuth,2007,Eve (II) Channing,actress,Marguerite Wyke,NaN
3370424,Sleuth,2007,Carmel O'Sullivan,actress,Maggie,NaN

### Now display the entire cast, in "n"-order, of the 2007 version of "Sleuth".

In [223]:
t13=(t11[t11.year == 2007])
t14=t13.sort_values("n")
t14

          title  year                 name     type          character    n
326774   Sleuth  2007        Michael Caine    actor             Andrew  1.0
1293634  Sleuth  2007             Jude Law    actor               Milo  2.0
1805907  Sleuth  2007        Harold Pinter    actor        Man on T.V.  3.0
260242   Sleuth  2007      Kenneth Branagh    actor  Other Man on T.V.  NaN
373877   Sleuth  2007  Alec (II) Cawthorne    actor  Inspector Doppler  NaN
2724552  Sleuth  2007    Eve (II) Channing  actress    Marguerite Wyke  NaN
3370424  Sleuth  2007    Carmel O'Sullivan  actress             Maggie  NaN

### How many roles were credited in the silent 1921 version of Hamlet?

In [229]:
t15=(cast[cast.title == "Hamlet"])
t16 =(t15[t15.year == 1921])
print("No of roles credited in Hamlet 1921 movie are ",t16.shape[0])

No of roles credited in Hamlet 1921 movie are  9

### How many roles were credited in Branaghâ€™s 1996 Hamlet?

In [232]:
t17=(cast[cast.title == "Hamlet"])
t18 =(t15[t15.year == 1996])
print("No of roles credited in Hamlet 1921 movie are ",t18.shape[0])

No of roles credited in Hamlet 1921 movie are  54

### How many "Hamlet" roles have been listed in all film credits through history?

In [259]:
print("No of roles credited in all Hamlet movies are ",t17.shape[0])

print("The total number of roles listed are (without n value) ", t17.shape[0] - t17.isna().sum().sum())

No of roles credited in all Hamlet movies are  342
The total number of roles listed are (without n value)  249

### How many people have played an "Ophelia"?

In [236]:
t19=(cast[cast.character == "Ophelia"])
print(len(t19)," People have played Ophelia character")

117  People have played Ophelia character

### How many people have played a role called "The Dude"?

In [237]:
t20=(cast[cast.character == "The Dude"])
print(len(t20)," People have played The Dude character")

19  People have played The Dude character

### How many people have played a role called "The Stranger"?

In [238]:
t21=(cast[cast.character == "The Stranger"])
print(len(t21)," People have played The Stranger character")

212  People have played The Stranger character

### How many roles has Sidney Poitier played throughout his career?

In [240]:
t22=(cast[cast.name == "Sidney Poitier"])
print("Sidney Poitier has played ",len(t22)," roles throughout his career")

Sidney Poitier has played  43  roles throughout his career

### How many roles has Judi Dench played?

In [241]:
t23=(cast[cast.name == "Judi Dench"])
print("Judi Dench has played ",len(t23)," roles throughout his career")

Judi Dench has played  55  roles throughout his career

### List the supporting roles (having n=2) played by Cary Grant in the 1940s, in order by year.

In [260]:
t28 = cast.loc[(cast['year'] >= 1940) & (cast['year'] < 1950) & (cast['n'] == 2) & (cast['name'] == 'Cary Grant')]

t28.sort_values('year')

                   title  year        name   type    character    n
871423  My Favorite Wife  1940  Cary Grant  actor   Nick Arden  2.0
871433    Penny Serenade  1941  Cary Grant  actor  Roger Adams  2.0

### List the leading roles that Cary Grant played in the 1940s in order by year.

In [261]:

cg1 = cast.loc[(cast['year'] >= 1940) & (cast['year'] < 1950) & (cast['n'] == 1) & (cast['name'] == 'Cary Grant')]
cg1.sort_values('year')

,title,year,name,type,character,n
871448,The Howards of Virginia,1940,Cary Grant,actor,Matt Howard,1.0
871407,His Girl Friday,1940,Cary Grant,actor,Walter Burns,1.0
871450,The Philadelphia Story,1940,Cary Grant,actor,C. K. Dexter Haven,1.0
871438,Suspicion,1941,Cary Grant,actor,Johnnie Aysgarth,1.0
871452,The Talk of the Town,1942,Cary Grant,actor,Leopold Dilg,1.0
871429,Once Upon a Honeymoon,1942,Cary Grant,actor,Patrick 'Pat' O'Toole,1.0
871398,Destination Tokyo,1943,Cary Grant,actor,Capt. Cassidy,1.0
871422,Mr. Lucky,1943,Cary Grant,actor,Joe Adams -posing as Joe Bascopolous,1.0
871430,Once Upon a Time,1944,Cary Grant,actor,Jerry Flynn,1.0
871390,Arsenic and Old Lace,1944,Cary Grant,actor,Mortimer Brewster,1.0
871425,None But the Lonely Heart,1944,Cary Grant,actor,Ernie Mott,1.0
871424,Night and Day,1946,Cary Grant,actor,Cole Porter,1.0
871427,Notorious,1946,Cary Grant,actor,Devlin,1.0
871444,The Bachelor and the Bobby-Soxer,1947,Cary Grant,actor,Dick Nugent,1.0
871445,The Bishop's Wife,1947,Cary Grant,actor,Dudley,1.0
871421,Mr. Blandings Builds His Dream House,1948,Cary Grant,actor,Jim Blandings,1.0
871402,Every Girl Should Be Married,1948,Cary Grant,actor,Dr. Madison Brown,1.0
871411,I Was a Male War Bride,1949,Cary Grant,actor,Captain Henri Rochard,1.0

### How many roles were available for actors in the 1950s?

In [265]:

t26 = cast.loc[(cast['year'] >= 1950) & (cast['year'] <= 1960)]
t27=(t26[t26.type == "actor"])
print(len(t27)," roles were available for actors in 1950s")

171302  roles were available for actors in 1950s

### How many roles were available for actresses in the 1950s?

In [266]:

t26 = cast.loc[(cast['year'] >= 1950) & (cast['year'] <= 1960)]
t28=(t26[t26.type == "actress"])
print(len(t28)," roles were available for actresses in 1950s")

63333  roles were available for actresses in 1950s

### How many leading roles (n=1) were available from the beginning of film history through 1980?

In [267]:

cast.sort_values('year').head()

,title,year,name,type,character,n
2612704,Miss Jerry,1894,Blanche Bayliss,actress,Miss Geraldine Holbrook (Miss Jerry),NaN
482247,Miss Jerry,1894,William Courtenay,actor,Mr. Hamilton,NaN
576354,Miss Jerry,1894,Chauncey Depew,actor,Himself - the Director of the New York Central...,NaN
1782161,Soldiers of the Cross,1900,Reg Perry,actor,Lion,NaN
1782006,Soldiers of the Cross,1900,Orrie Perry,actor,Lion,NaN

In [268]:
lr = cast.loc[(cast['year'] >= 1894) & (cast['year'] <= 1980) & (cast['n'] == 1)]
print(lr.shape[0], "leading roles were available from beginning to 1980")

65140 leading roles were available from beginning to 1980

### How many non-leading roles were available through from the beginning of film history through 1980?

In [269]:
nlr = cast.loc[(cast['year'] >= 1894) & (cast['year'] <= 1980) & (cast['n'] != 1)]
print(nlr.shape[0], "non-leading roles were available from beginning to 1980")

1117667 non-leading roles were available from beginning to 1980

### How many roles through 1980 were minor enough that they did not warrant a numeric "n" rank?

In [270]:
wlr = cast.loc[(cast['year'] >= 1894) & (cast['year'] <= 1980)]
print(wlr.isna().sum(), "\n\n\n")
print(wlr.isna().sum().sum(), "roles through 1980 were minor")

title             0
year              0
name              0
type              0
character         0
n            448347
dtype: int64



448347 roles through 1980 were minor